package ua.sergey.kostyniuk;

public class Sort {  //преревірка на топ 6
	public static String[] m = 
		{       "Моє ім'я - Батьківщина",
				"Лелеки легке крило.",
				"Моє ім'я - Україна",
				"І сонечка тепло.",
				"Моє ім'я - Вишиванка",
				"Я - хрестик на полотні.",
				"Моє ім'я - синє небо",
				"Я - сонях малий під ним.",

				"Приспів:",
				"Татові слова:",
				"Україна - це я!",
				"Мамині пісні",
				"Україна - це ти!",
				
				"Приспів:",
				"Татові слова:",
				"Україна - це я!",
				"Мамині пісні",
				"Україна - це ти!",

				"Моє ім'я - Степ широкий",
				"Моє ім'я - Хліба смак",
				"Останній шкільний дзвіночок",
				"Над сивим Дніпром туман.",
				"Моє ім'я - то Надія",
				"Моє ім'я - то Любов",
				"Моє ім'я - чиста мрія",
				"І віра, що з нами Бог!",

				"Приспів:",
				"Татові слова:",
				"Україна - це я!",
				"Мамині пісні",
				"Україна - це ти!",
				
				"Приспів:",
				"Татові слова:",
				"Україна - це я!",
				"Мамині пісні",
				"Україна - це ти!",

				"Моє ім'я - колискова...",
				"Моє ім'я - то є Воля...",
				"Моє ім'я - то Родина...",
				"Моє ім'я - добре Слово",
				"Що збереже цей світ!",

				"Приспів:",
				"Татові слова:",
				"Україна - це я!",
				"Мамині пісні",
				"Україна - це ти!",
				

				"Україна - це ти!..",

				"Приспів:",
				"Татові слова:",
				"Україна - це я!",
				"Мамині пісні",
				"Україна - це ти!",
				
				"Приспів:",
				"Татові слова:",
				"Україна - це я!",
				"Мамині пісні",
				"Україна - це ти!"}; //Наш массив
	
	
	
    public static String pCh[] = new String[m.length]; //Массив предыдущих чисел

    
    
    public static int ts;
    public static int tss;
    public static int[] n = new int[m.length];   //Номера з повторами
   
    
    
    
    public static void main(String[] args) {  
  
        int k = 0;

		String ch;
        for(ts = 0; ts<m.length; ts++){
        	
            if (!povtor(ch=m[ts])){              //чи не повторювалось вже
                ch=m[ts];
                for(int ts2=0;ts2<m.length;ts2++)             
                    if(m[ts2]==ch){   
                        n[k]=ts2+1;  
                        k++;         //кількість повторів
                    }
                if (k>6){            //якщо більше 6
                    System.out.print("то 6 найбільш вживаних фраз ");
                  //  for(int a=0;a<k;a++) System.out.print(" "+n[a]);
                    System.out.println(": "+ch);
                }
                k=0; //Обнуляємо
                pCh[ts]=ch; 
            }
            
        }
    }
    static boolean povtor(String i){          
        for(int a = 0; a<ts;a++){
            if (pCh[a]==i) return true;
        }
        return false;
    }
 
}


